Documents/ГрузовоеМесто.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ГрузовоеМесто</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сборка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Погружено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактуально_КорректировкаСборки</Name>
					<Comment>Документ неактуален вследствие корректировки сборки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректировкаСборки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаСборкиЗаказовПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияСамовывоза</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШКОбособленного</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПечатиШтрихкода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихкодГрузовогоМеста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ГрузовоеМесто/Ext/ManagerModule.bsl
Функция ПолучитьШтрихкодГрузоместа(ГМ) Экспорт
	
	Если ГМ.Дата < НачалоДня(Дата(2020,03,31,00,00,00)) Тогда		
		Возврат Формат(ГМ.Дата, "ДФ=ddMMyyyy") + "" + СокрЛП(ГМ.Номер);		
	Иначе        
		
		Если ЗначениеЗаполнено(ГМ.Сборка.Назначение) Тогда
			Возврат Формат(ГМ.ДатаПечатиШтрихкода, "ДФ=ddMMyyyyЧЧммсс") + "1" + Формат(Число(ГМ.Номер), "ЧЦ=10; ЧВН=; ЧГ=0"); 				
		Иначе
			
			Если ЗначениеЗаполнено(ГМ.ШКОбособленного) Тогда                                                                                     
				Возврат ГМ.ШКОбособленного; 	
			Иначе
				Возврат Формат(ГМ.Дата, "ДФ=ddMMyyyy") + "" + Формат(Число(ГМ.Номер), "ЧЦ=17; ЧВН=; ЧГ=0");					
			КонецЕсли;
			
		КонецЕсли;  
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ПолучитьВесГМ(ГМ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГрузовоеМестоТовары.Номенклатура,
	|	ГрузовоеМестоТовары.Количество,
	|	ГрузовоеМестоТовары.Заказ
	|ПОМЕСТИТЬ ВТ_ТоварыГМ
	|ИЗ
	|	Документ.ГрузовоеМесто.Товары КАК ГрузовоеМестоТовары
	|ГДЕ
	|	ГрузовоеМестоТовары.Ссылка = &ГМ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказПокупателяТовары.Ссылка КАК Заказ,
	|	МАКСИМУМ(ЗаказПокупателяТовары.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	ЗаказПокупателяТовары.Номенклатура
	|ПОМЕСТИТЬ ВТ_ЕдиницыЗаказа
	|ИЗ
	|	Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	|ГДЕ
	|	ЗаказПокупателяТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ТоварыГМ.Заказ
	|			ИЗ
	|				ВТ_ТоварыГМ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказПокупателяТовары.Ссылка,
	|	ЗаказПокупателяТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТоварыГМ.Количество,
	|	ВТ_ЕдиницыЗаказа.ЕдиницаИзмерения,
	|	ВТ_ТоварыГМ.Номенклатура
	|ПОМЕСТИТЬ ВТ_Итоговая
	|ИЗ
	|	ВТ_ТоварыГМ КАК ВТ_ТоварыГМ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЕдиницыЗаказа КАК ВТ_ЕдиницыЗаказа
	|		ПО ВТ_ТоварыГМ.Номенклатура = ВТ_ЕдиницыЗаказа.Номенклатура
	|			И ВТ_ТоварыГМ.Заказ = ВТ_ЕдиницыЗаказа.Заказ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_Итоговая.Количество * ВТ_Итоговая.ЕдиницаИзмерения.Вес) КАК Вес
	|ИЗ
	|	ВТ_Итоговая КАК ВТ_Итоговая";
	
	Запрос.УстановитьПараметр("ГМ", ГМ);  
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Вес;
	КонецЕсли;              
	
	Возврат 0;
	
КонецФункции
